# ETL

## Imports

In [1]:
import os
import re

from sqlalchemy import create_engine
import numpy as np
import pandas as pd

## Enviroument variables

In [2]:
# export DATABASE_URI='mysql+pymysql://root:root@0.0.0.0:3306/BIKES'
# set DATABASE_URI='mysql+pymysql://root:root@0.0.0.0:3306/BIKES'
DATABASE_URI = os.environ.get('DATABASE_URI')

if not DATABASE_URI:
    raise ValueError('No DATABASE_URI variable was set')

## Database connection

In [3]:
engine = create_engine(DATABASE_URI)
engine.connect()

## Functions

In [4]:
def to_upper(text: str) -> str:
    """To upper case non null text"""
    if text is not None:
        return text.upper()

In [5]:
def to_lower(text: str) -> str:
    """To lower case non null text"""
    if text is not None:
        return text.lower()

In [6]:
def id_to_captilize(text: str) -> str:
    """Replace string non null text that ends with ID to Id"""
    if text is not None:
        return re.sub(r'(^.*)ID', r'\1Id', text)

In [7]:
def to_snake_case(text: str) -> str:
    """To snake case non null text"""
    if text is not None:
        return re.sub(r'(?<!^)(?=[A-Z])', '_', text)

In [8]:
def to_float(text: str) -> float:
    """String to float format"""
    if text is not None:
        return float(text.replace(',', '.'))

## Person

### Loading dataset

In [9]:
dataframe = pd.read_csv('../dataset/Person.Person.csv', sep=';')
dataframe.head()

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0,NaN,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07 00:00:00.000
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1,NaN,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24 00:00:00.000
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0,NaN,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04 00:00:00.000
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0,NaN,"<IndividualSurvey xmlns=""http://schemas.micros...",F2D7CE06-38B3-4357-805B-F4B6B71C01FF,2007-11-28 00:00:00.000
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0,NaN,"<IndividualSurvey xmlns=""http://schemas.micros...",F3A3F6B4-AE3B-430C-A754-9F2231BA6FEF,2007-12-30 00:00:00.000

### Rename dataframe header

In [10]:
dataframe.columns

Index(['BusinessEntityID', 'PersonType', 'NameStyle', 'Title', 'FirstName',
       'MiddleName', 'LastName', 'Suffix', 'EmailPromotion',
       'AdditionalContactInfo', 'Demographics', 'rowguid', 'ModifiedDate'],
      dtype='object')

In [11]:
dataframe.columns = [to_upper((to_snake_case(id_to_captilize(column)))) for column in dataframe.columns]

In [12]:
dataframe.columns

Index(['BUSINESS_ENTITY_ID', 'PERSON_TYPE', 'NAME_STYLE', 'TITLE',
       'FIRST_NAME', 'MIDDLE_NAME', 'LAST_NAME', 'SUFFIX', 'EMAIL_PROMOTION',
       'ADDITIONAL_CONTACT_INFO', 'DEMOGRAPHICS', 'ROWGUID', 'MODIFIED_DATE'],
      dtype='object')

In [13]:
dataframe.rename({'BUSINESS_ENTITY_ID': 'PERSON_ID'}, axis=1, inplace=True)

### Fix TITLE column

In [14]:
dataframe.TITLE.value_counts()

Mr.     577
Ms.     415
Sr.      11
Sra.      3
Mrs.      2
Ms        1
Name: TITLE, dtype: int64

In [15]:
dataframe.TITLE.replace({'Ms': 'Ms.'}, inplace=True)

In [16]:
dataframe.TITLE.value_counts()

Mr.     577
Ms.     416
Sr.      11
Sra.      3
Mrs.      2
Name: TITLE, dtype: int64

### Populate

In [17]:
dataframe.to_sql('PERSON', engine, if_exists='append', index=False)

### Select

In [18]:
query = """
SELECT *
FROM PERSON
LIMIT 3
"""

In [19]:
pd.read_sql(query, engine)

,PERSON_ID,PERSON_TYPE,NAME_STYLE,TITLE,FIRST_NAME,MIDDLE_NAME,LAST_NAME,SUFFIX,EMAIL_PROMOTION,ADDITIONAL_CONTACT_INFO,DEMOGRAPHICS,ROWGUID,MODIFIED_DATE
0,1,EM,0,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07
1,2,EM,0,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24
2,3,EM,0,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04

## Customer

### Loading dataset

In [20]:
dataframe = pd.read_csv('../dataset/Sales.Customer.csv', sep=';')
dataframe.head()

,CustomerID,PersonID,StoreID,TerritoryID,AccountNumber,rowguid,ModifiedDate
0,1,NaN,934.0,1,AW00000001,3F5AE95E-B87D-4AED-95B4-C3797AFCB74F,2014-09-12 11:15:07.263
1,2,NaN,1028.0,1,AW00000002,E552F657-A9AF-4A7D-A645-C429D6E02491,2014-09-12 11:15:07.263
2,3,NaN,642.0,4,AW00000003,130774B1-DB21-4EF3-98C8-C104BCD6ED6D,2014-09-12 11:15:07.263
3,4,NaN,932.0,4,AW00000004,FF862851-1DAA-4044-BE7C-3E85583C054D,2014-09-12 11:15:07.263
4,5,NaN,1026.0,4,AW00000005,83905BDC-6F5E-4F71-B162-C98DA069F38A,2014-09-12 11:15:07.263

### Rename dataframe header

In [21]:
dataframe.columns

Index(['CustomerID', 'PersonID', 'StoreID', 'TerritoryID', 'AccountNumber',
       'rowguid', 'ModifiedDate'],
      dtype='object')

In [22]:
dataframe.columns = [to_upper((to_snake_case(id_to_captilize(column)))) for column in dataframe.columns]

In [23]:
dataframe.columns

Index(['CUSTOMER_ID', 'PERSON_ID', 'STORE_ID', 'TERRITORY_ID',
       'ACCOUNT_NUMBER', 'ROWGUID', 'MODIFIED_DATE'],
      dtype='object')

### Populate

In [24]:
dataframe.to_sql('CUSTOMER', engine, if_exists='append', index=False)

In [25]:
query = """
SELECT *
FROM CUSTOMER
LIMIT 3
"""

In [26]:
pd.read_sql(query, engine)

,CUSTOMER_ID,PERSON_ID,STORE_ID,TERRITORY_ID,ACCOUNT_NUMBER,ROWGUID,MODIFIED_DATE
0,1,None,934,1,AW00000001,3F5AE95E-B87D-4AED-95B4-C3797AFCB74F,2014-09-12 11:15:07
1,2,None,1028,1,AW00000002,E552F657-A9AF-4A7D-A645-C429D6E02491,2014-09-12 11:15:07
2,3,None,642,4,AW00000003,130774B1-DB21-4EF3-98C8-C104BCD6ED6D,2014-09-12 11:15:07

## Sales Order Header

### Loading datase

In [27]:
dataframe = pd.read_csv('../dataset/Sales.SalesOrderHeader.csv', sep=';')
dataframe.head()

,SalesOrderID,RevisionNumber,OrderDate,DueDate,ShipDate,Status,OnlineOrderFlag,SalesOrderNumber,PurchaseOrderNumber,AccountNumber,...,CreditCardID,CreditCardApprovalCode,CurrencyRateID,SubTotal,TaxAmt,Freight,TotalDue,Comment,rowguid,ModifiedDate
0,43659,8,2011-05-31 00:00:00.000,2011-06-12 00:00:00.000,2011-06-07 00:00:00.000,5,0,SO43659,PO522145787,10-4020-000676,...,16281.0,105041Vi84182,NaN,"20565,6206","1971,5149","616,0984","23153,2339",NaN,79B65321-39CA-4115-9CBA-8FE0903E12E6,2011-06-07 00:00:00.000
1,43660,8,2011-05-31 00:00:00.000,2011-06-12 00:00:00.000,2011-06-07 00:00:00.000,5,0,SO43660,PO18850127500,10-4020-000117,...,5618.0,115213Vi29411,NaN,"1294,2529","124,2483","38,8276","1457,3288",NaN,738DC42D-D03B-48A1-9822-F95A67EA7389,2011-06-07 00:00:00.000
2,43661,8,2011-05-31 00:00:00.000,2011-06-12 00:00:00.000,2011-06-07 00:00:00.000,5,0,SO43661,PO18473189620,10-4020-000442,...,1346.0,85274Vi6854,4.0,"32726,4786","3153,7696","985,553","36865,8012",NaN,D91B9131-18A4-4A11-BC3A-90B6F53E9D74,2011-06-07 00:00:00.000
3,43662,8,2011-05-31 00:00:00.000,2011-06-12 00:00:00.000,2011-06-07 00:00:00.000,5,0,SO43662,PO18444174044,10-4020-000227,...,10456.0,125295Vi53935,4.0,"28832,5289","2775,1646","867,2389","32474,9324",NaN,4A1ECFC0-CC3A-4740-B028-1C50BB48711C,2011-06-07 00:00:00.000
4,43663,8,2011-05-31 00:00:00.000,2011-06-12 00:00:00.000,2011-06-07 00:00:00.000,5,0,SO43663,PO18009186470,10-4020-000510,...,4322.0,45303Vi22691,NaN,"419,4589","40,2681","12,5838","472,3108",NaN,9B1E7A40-6AE0-4AD3-811C-A64951857C4B,2011-06-07 00:00:00.000

### Rename dataframe header

In [28]:
dataframe.columns

Index(['SalesOrderID', 'RevisionNumber', 'OrderDate', 'DueDate', 'ShipDate',
       'Status', 'OnlineOrderFlag', 'SalesOrderNumber', 'PurchaseOrderNumber',
       'AccountNumber', 'CustomerID', 'SalesPersonID', 'TerritoryID',
       'BillToAddressID', 'ShipToAddressID', 'ShipMethodID', 'CreditCardID',
       'CreditCardApprovalCode', 'CurrencyRateID', 'SubTotal', 'TaxAmt',
       'Freight', 'TotalDue', 'Comment', 'rowguid', 'ModifiedDate'],
      dtype='object')

In [29]:
dataframe.columns = [to_upper((to_snake_case(id_to_captilize(column)))) for column in dataframe.columns]

In [30]:
dataframe.columns

Index(['SALES_ORDER_ID', 'REVISION_NUMBER', 'ORDER_DATE', 'DUE_DATE',
       'SHIP_DATE', 'STATUS', 'ONLINE_ORDER_FLAG', 'SALES_ORDER_NUMBER',
       'PURCHASE_ORDER_NUMBER', 'ACCOUNT_NUMBER', 'CUSTOMER_ID',
       'SALES_PERSON_ID', 'TERRITORY_ID', 'BILL_TO_ADDRESS_ID',
       'SHIP_TO_ADDRESS_ID', 'SHIP_METHOD_ID', 'CREDIT_CARD_ID',
       'CREDIT_CARD_APPROVAL_CODE', 'CURRENCY_RATE_ID', 'SUB_TOTAL', 'TAX_AMT',
       'FREIGHT', 'TOTAL_DUE', 'COMMENT', 'ROWGUID', 'MODIFIED_DATE'],
      dtype='object')

### Fix float values

In [31]:
dataframe.replace({np.nan: None}, inplace=True)

In [32]:
dataframe.SUB_TOTAL = dataframe.SUB_TOTAL.apply(to_float)
dataframe.TAX_AMT = dataframe.TAX_AMT.apply(to_float)
dataframe.FREIGHT = dataframe.FREIGHT.apply(to_float)
dataframe.TOTAL_DUE = dataframe.TOTAL_DUE.apply(to_float)

### Populate

In [33]:
dataframe.to_sql('SALES_ORDER_HEADER', engine, if_exists='append', index=False)

In [34]:
query = """
SELECT *
FROM SALES_ORDER_HEADER
LIMIT 3
"""

In [35]:
pd.read_sql(query, engine)

,SALES_ORDER_ID,REVISION_NUMBER,DUE_DATE,ORDER_DATE,SHIP_DATE,STATUS,ONLINE_ORDER_FLAG,SALES_ORDER_NUMBER,PURCHASE_ORDER_NUMBER,ACCOUNT_NUMBER,...,CREDIT_CARD_ID,CREDIT_CARD_APPROVAL_CODE,CURRENCY_RATE_ID,SUB_TOTAL,TAX_AMT,FREIGHT,TOTAL_DUE,COMMENT,ROWGUID,MODIFIED_DATE
0,43659,8,2011-06-12,2011-05-31,2011-06-07,5,0,SO43659,PO522145787,10-4020-000676,...,16281,105041Vi84182,NaN,20565.60,1971.510,616.0980,23153.20,None,79B65321-39CA-4115-9CBA-8FE0903E12E6,2011-06-07
1,43660,8,2011-06-12,2011-05-31,2011-06-07,5,0,SO43660,PO18850127500,10-4020-000117,...,5618,115213Vi29411,NaN,1294.25,124.248,38.8276,1457.33,None,738DC42D-D03B-48A1-9822-F95A67EA7389,2011-06-07
2,43661,8,2011-06-12,2011-05-31,2011-06-07,5,0,SO43661,PO18473189620,10-4020-000442,...,1346,85274Vi6854,4.0,32726.50,3153.770,985.5530,36865.80,None,D91B9131-18A4-4A11-BC3A-90B6F53E9D74,2011-06-07

## Product

### Loading datase

In [36]:
dataframe = pd.read_csv('../dataset/Production.Product.csv', sep=';')
dataframe.head()

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,1,Adjustable Race,AR-5381,0,0,NaN,1000,750,"0,00","0,00",...,NaN,NaN,NaN,NaN,NaN,2008-04-30 00:00:00.000,NaN,NaN,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:36.827
1,2,Bearing Ball,BA-8327,0,0,NaN,1000,750,"0,00","0,00",...,NaN,NaN,NaN,NaN,NaN,2008-04-30 00:00:00.000,NaN,NaN,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:36.827
2,3,BB Ball Bearing,BE-2349,1,0,NaN,800,600,"0,00","0,00",...,NaN,NaN,NaN,NaN,NaN,2008-04-30 00:00:00.000,NaN,NaN,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:36.827
3,4,Headset Ball Bearings,BE-2908,0,0,NaN,800,600,"0,00","0,00",...,NaN,NaN,NaN,NaN,NaN,2008-04-30 00:00:00.000,NaN,NaN,ECFED6CB-51FF-49B5-B06C-7D8AC834DB8B,2014-02-08 10:01:36.827
4,316,Blade,BL-2036,1,0,NaN,800,600,"0,00","0,00",...,NaN,NaN,NaN,NaN,NaN,2008-04-30 00:00:00.000,NaN,NaN,E73E9750-603B-4131-89F5-3DD15ED5FF80,2014-02-08 10:01:36.827

### Rename dataframe header

In [37]:
dataframe.columns

Index(['ProductID', 'Name', 'ProductNumber', 'MakeFlag', 'FinishedGoodsFlag',
       'Color', 'SafetyStockLevel', 'ReorderPoint', 'StandardCost',
       'ListPrice', 'Size', 'SizeUnitMeasureCode', 'WeightUnitMeasureCode',
       'Weight', 'DaysToManufacture', 'ProductLine', 'Class', 'Style',
       'ProductSubcategoryID', 'ProductModelID', 'SellStartDate',
       'SellEndDate', 'DiscontinuedDate', 'rowguid', 'ModifiedDate'],
      dtype='object')

In [38]:
dataframe.columns = [to_upper((to_snake_case(id_to_captilize(column)))) for column in dataframe.columns]

In [39]:
dataframe.columns

Index(['PRODUCT_ID', 'NAME', 'PRODUCT_NUMBER', 'MAKE_FLAG',
       'FINISHED_GOODS_FLAG', 'COLOR', 'SAFETY_STOCK_LEVEL', 'REORDER_POINT',
       'STANDARD_COST', 'LIST_PRICE', 'SIZE', 'SIZE_UNIT_MEASURE_CODE',
       'WEIGHT_UNIT_MEASURE_CODE', 'WEIGHT', 'DAYS_TO_MANUFACTURE',
       'PRODUCT_LINE', 'CLASS', 'STYLE', 'PRODUCT_SUBCATEGORY_ID',
       'PRODUCT_MODEL_ID', 'SELL_START_DATE', 'SELL_END_DATE',
       'DISCONTINUED_DATE', 'ROWGUID', 'MODIFIED_DATE'],
      dtype='object')

### Fix float values

In [40]:
dataframe.STANDARD_COST = dataframe.STANDARD_COST.apply(to_float)
dataframe.LIST_PRICE = dataframe.LIST_PRICE.apply(to_float)

### Populate

In [41]:
dataframe.to_sql('PRODUCT', engine, if_exists='append', index=False)

In [42]:
query = """
SELECT *
FROM PRODUCT
LIMIT 3
"""

In [43]:
pd.read_sql(query, engine)

,PRODUCT_ID,NAME,PRODUCT_NUMBER,MAKE_FLAG,FINISHED_GOODS_FLAG,COLOR,SAFETY_STOCK_LEVEL,REORDER_POINT,STANDARD_COST,LIST_PRICE,...,PRODUCT_LINE,CLASS,STYLE,PRODUCT_SUBCATEGORY_ID,PRODUCT_MODEL_ID,SELL_START_DATE,SELL_END_DATE,DISCONTINUED_DATE,ROWGUID,MODIFIED_DATE
0,1,Adjustable Race,AR-5381,0,0,None,1000,750,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:37
1,2,Bearing Ball,BA-8327,0,0,None,1000,750,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:37
2,3,BB Ball Bearing,BE-2349,1,0,None,800,600,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:37

## Special Offer Product

### Loading datase

In [44]:
dataframe = pd.read_csv('../dataset/Sales.SpecialOfferProduct.csv', sep=';')
dataframe.head()

,SpecialOfferID,ProductID,rowguid,ModifiedDate
0,1,680,BB30B868-D86C-4557-8DB2-4B2D0A83A0FB,2011-04-01 00:00:00.000
1,1,706,B3C9A4B1-2AE6-4CBA-B552-1F206C9F4C1F,2011-04-01 00:00:00.000
2,1,707,27B711FE-0B77-4EA4-AD1A-7C239956BEF4,2011-04-01 00:00:00.000
3,1,708,46CBB78B-246E-4D69-9BD6-E521277C1078,2011-04-01 00:00:00.000
4,1,709,CF102AA0-055F-4D2B-8B98-04B161758EA8,2011-04-01 00:00:00.000

### Rename dataframe header

In [45]:
dataframe.columns

Index(['SpecialOfferID', 'ProductID', 'rowguid', 'ModifiedDate'], dtype='object')

In [46]:
dataframe.columns = [to_upper((to_snake_case(id_to_captilize(column)))) for column in dataframe.columns]

In [47]:
dataframe.columns

Index(['SPECIAL_OFFER_ID', 'PRODUCT_ID', 'ROWGUID', 'MODIFIED_DATE'], dtype='object')

### Populate

In [48]:
dataframe.to_sql('SPECIAL_OFFER_PRODUCT', engine, if_exists='append', index=False)

In [49]:
query = """
SELECT *
FROM SPECIAL_OFFER_PRODUCT
LIMIT 3
"""

In [50]:
pd.read_sql(query, engine)

,SPECIAL_OFFER_ID,PRODUCT_ID,ROWGUID,MODIFIED_DATE
0,1,680,BB30B868-D86C-4557-8DB2-4B2D0A83A0FB,2011-04-01
1,1,706,B3C9A4B1-2AE6-4CBA-B552-1F206C9F4C1F,2011-04-01
2,1,707,27B711FE-0B77-4EA4-AD1A-7C239956BEF4,2011-04-01

## Sales Order Detail

### Loading datase

In [51]:
dataframe = pd.read_csv('../dataset/Sales.SalesOrderDetail.csv', sep=';')
dataframe.head()

,SalesOrderID,SalesOrderDetailID,CarrierTrackingNumber,OrderQty,ProductID,SpecialOfferID,UnitPrice,UnitPriceDiscount,LineTotal,rowguid,ModifiedDate
0,43659,1,4911-403C-98,1,776,1,"2024,994","0,00",2024.994,B207C96D-D9E6-402B-8470-2CC176C42283,2011-05-31 00:00:00.000
1,43659,2,4911-403C-98,3,777,1,"2024,994","0,00",6074.982,7ABB600D-1E77-41BE-9FE5-B9142CFC08FA,2011-05-31 00:00:00.000
2,43659,3,4911-403C-98,1,778,1,"2024,994","0,00",2024.994,475CF8C6-49F6-486E-B0AD-AFC6A50CDD2F,2011-05-31 00:00:00.000
3,43659,4,4911-403C-98,1,771,1,"2039,994","0,00",2039.994,04C4DE91-5815-45D6-8670-F462719FBCE3,2011-05-31 00:00:00.000
4,43659,5,4911-403C-98,1,772,1,"2039,994","0,00",2039.994,5A74C7D2-E641-438E-A7AC-37BF23280301,2011-05-31 00:00:00.000

### Rename dataframe header

In [52]:
dataframe.columns

Index(['SalesOrderID', 'SalesOrderDetailID', 'CarrierTrackingNumber',
       'OrderQty', 'ProductID', 'SpecialOfferID', 'UnitPrice',
       'UnitPriceDiscount', 'LineTotal', 'rowguid', 'ModifiedDate'],
      dtype='object')

In [53]:
dataframe.columns = [to_upper((to_snake_case(id_to_captilize(column)))) for column in dataframe.columns]

In [54]:
dataframe.columns

Index(['SALES_ORDER_ID', 'SALES_ORDER_DETAIL_ID', 'CARRIER_TRACKING_NUMBER',
       'ORDER_QTY', 'PRODUCT_ID', 'SPECIAL_OFFER_ID', 'UNIT_PRICE',
       'UNIT_PRICE_DISCOUNT', 'LINE_TOTAL', 'ROWGUID', 'MODIFIED_DATE'],
      dtype='object')

### Fix float values

In [55]:
dataframe.UNIT_PRICE = dataframe.UNIT_PRICE.apply(to_float)
dataframe.UNIT_PRICE_DISCOUNT = dataframe.UNIT_PRICE_DISCOUNT.apply(to_float)

### Populate

In [56]:
dataframe.to_sql('SALES_ORDER_DETAIL', engine, if_exists='append', index=False)

In [57]:
query = """
SELECT *
FROM SALES_ORDER_DETAIL
LIMIT 3
"""

In [58]:
pd.read_sql(query, engine)

,SALES_ORDER_DETAIL_ID,SALES_ORDER_ID,SPECIAL_OFFER_ID,PRODUCT_ID,CARRIER_TRACKING_NUMBER,ORDER_QTY,UNIT_PRICE,UNIT_PRICE_DISCOUNT,LINE_TOTAL,ROWGUID,MODIFIED_DATE
0,1,43659,1,776,4911-403C-98,1,2024.99,0.0,2025,B207C96D-D9E6-402B-8470-2CC176C42283,2011-05-31
1,2,43659,1,777,4911-403C-98,3,2024.99,0.0,6075,7ABB600D-1E77-41BE-9FE5-B9142CFC08FA,2011-05-31
2,3,43659,1,778,4911-403C-98,1,2024.99,0.0,2025,475CF8C6-49F6-486E-B0AD-AFC6A50CDD2F,2011-05-31